[ti:执迷不悔 (国)]
[ar:王菲]
[al:王菲的故事]
[00:00.00]执迷不悔 (国)
[00:03.67]
[00:04.51]作词：王bai菲 作曲：袁惟仁
[00:07.66]演唱：王菲 编曲/监制：杜自持
[00:11.18]
[00:22.54]这一次我执著面对 任性地沉醉
[00:29.24]我并不在乎 这是错还是对
[00:36.16]就算是深陷 我不顾一切
[00:42.20][01:11.21][02:38.47]就算是执迷 我也执迷不悔
[00:48.74]
[00:51.45][02:18.93]别说我应该放弃 应该睁开眼
[00:58.35]我用我的心 去看~去感觉
[01:05.12][02:01.64]只能执迷~而不悔
[01:17.59]
[01:20.49]我不是你们想得如此完美
[01:23.85]我承认有时也会辨不清真伪
[01:27.22]并非我不愿意走出迷堆
[01:30.78]只是这一次
[01:32.61]这次是自己而不是谁
[01:36.33]
[01:37.69]要我用谁的心去体会
[01:41.02]真真切切的感受周围
[01:44.38]就算痛苦 就算是泪
[01:47.84]也是属於我的伤悲
[01:51.37]我还能用谁的心去体会
[01:54.66]真真切切地感受周围
[01:58.14]就算疲倦 就算是累
[02:07.34]
[02:09.22]------
[02:15.25]
[02:25.54]我用我的心 去看~去感觉
[02:32.43]你并不是我 又怎能了解

[02:45.56]

